app/controllers/users_controller.rb

  def create
    #获得表单值
    user=User.new(params[:user])
    #10个随机生成的数字
    user.key=""#初值
    10.times do
      user.key<<rand(10).to_s
---
INSERT INTO `users` (`name`, `updated_at`, `icon`, `mail`, `pwd`, `key`, `created_at`, `state`) VALUES('c1', '2010-02-21 18:21:45', NULL, 'c1@com', 'efe64cbc0c2ac24c60e9c53cd2147c48', '7124884695', '2010-02-21 18:21:45', 100)

  def login_check

    #可以按用户名或mail方式登录
    if params[:name].include?('@')
      user=User.find_by_mail(params[:name].strip)
    else
      user=User.find_by_name(params[:name].strip)
---
SELECT * FROM `users` WHERE (`users`.`mail` = 'cao@mail.com') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`name` = 'cao') LIMIT 1

  def edit
    @user=User.find_by_id(session[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 19) LIMIT 1

  def update
    @user=User.find_by_id(session[:id])
    User.transaction do
      #密码更新
      if params[:user][:raw_pwd].strip!=""
        @user.pwd=Digest::MD5.hexdigest(params[:user][:raw_pwd].strip+@user.key)
      end
      #如上传了头像，重新处理即可，旧文件会被重写
      icon_file=params[:icon_file]
      handel_icon(icon_file, @user)

      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 19) LIMIT 1
UPDATE `users` SET `pwd` = 'c5104e831fcb442e25fabd3d615dcdf8', `updated_at` = '2010-02-21 21:32:11' WHERE `id` = 19